Autodesk.Revit.DB.UnitTypeId.WattsPerSquareMeterKelvin
Watts per square meter kelvin.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.WattsPerSquareMeter
Watts per square meter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.WattsPerSquareFoot
Watts per square foot.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.WattsPerMeterKelvin
Watts per meter kelvin.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.WattsPerMeter
Watts per meter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.WattsPerFoot
Watts per foot.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.WattsPerCubicMeterPerSecond
Watts per cubic meter per second.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.WattsPerCubicMeter
Watts per cubic meter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.WattsPerCubicFootPerMinute
Watts per cubic foot per minute.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.WattsPerCubicFoot
Watts per cubic foot.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Watts
Watts.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Volts
Volts.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.VoltAmperesPerSquareMeter
Volt amperes per square meter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.VoltAmperesPerSquareFoot
Volt amperes per square foot.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.VoltAmperes
Volt amperes.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.UsTonnesMass
US tonnes mass.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.UsTonnesForce
US tonnes force.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.UsSurveyFeet
US survey feet.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.UsGallonsPerMinute
US gallons per minute.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.UsGallonsPerHour
US gallons per hour.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.UsGallons
US gallons.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.TonsOfRefrigeration
Tons of refrigeration.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.TonnesForcePerSquareMeter
Tonnes force per square meter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.TonnesForcePerMeter
Tonnes force per meter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.TonnesForce
Tonnes force.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Tonnes
Tonnes.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.TonneForceMetersPerMeter
Tonne force meters per meter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.TonneForceMeters
Tonne force meters.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.ThousandBritishThermalUnitsPerHour
Thousand British thermal units per hour.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Therms
Therms.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.SquareMillimetersPerMeter
Square millimeters per meter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.SquareMillimeters
Square millimeters.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.SquareMetersPerSecond
Square meters per second.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.SquareMetersPerMeter
Square meters per meter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.SquareMetersPerKilowatt
Square meters per kilowatt.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.SquareMetersPerKilonewton
Square meters per kilonewton.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.SquareMeters
Square meters.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.SquareMeterKelvinsPerWatt
Square meter kelvins per watt.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.SquareInchesPerFoot
Square inches per foot.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.SquareInches
Square inches.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.SquareFeetPerTonOfRefrigeration
Square feet per ton of refrigeration.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.SquareFeetPerSecond
Square feet per second.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.SquareFeetPerKip
Square feet per kip.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.SquareFeetPerFoot
Square feet per foot.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.SquareFeetPer1000BritishThermalUnitsPerHour
Square feet per thousand British thermal units per hour.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.SquareFeet
Square feet.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.SquareCentimetersPerMeter
Square centimeters per meter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.SquareCentimeters
Square centimeters.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Seconds
Seconds.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.RiseDividedBy1Foot
Rise / 1 foot.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.RiseDividedBy12Inches
Rise / 12 inches.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.RiseDividedBy120Inches
Rise / 120 inches.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.RiseDividedBy10Feet
Rise / 10 feet.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.RiseDividedBy1000Millimeters
Rise / 1000 millimeters.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.RevolutionsPerSecond
Revolutions per second.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.RevolutionsPerMinute
Revolutions per minute.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.RatioTo12
Ratio : 12.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.RatioTo10
Ratio : 10.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.RatioTo1
Ratio : 1.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.RankineInterval
Rankine interval.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Rankine
Rankine.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.RadiansPerSecond
Radians per second.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Radians
Radians.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.PoundsMassPerSquareFoot
Pounds mass per square foot.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.PoundsMassPerSecond
Pounds mass per second.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.PoundsMassPerPoundDegreeFahrenheit
Pounds mass per pound degree Fahrenheit.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.PoundsMassPerMinute
Pounds mass per minute.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.PoundsMassPerHour
Pounds mass per hour.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.PoundsMassPerFootSecond
Pounds mass per foot second.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.PoundsMassPerFootHour
Pounds mass per foot hour.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.PoundsMassPerFoot
Pounds mass per foot.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.PoundsMassPerCubicInch
Pounds mass per cubic inch.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.PoundsMassPerCubicFoot
Pounds mass per cubic foot.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.PoundsMass
Pounds mass.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.PoundsForcePerSquareInch
Pounds force per square inch.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.PoundsForcePerSquareFoot
Pounds force per square foot.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.PoundsForcePerFoot
Pounds force per foot.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.PoundsForcePerCubicFoot
Pounds force per cubic foot.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.PoundsForce
Pounds force.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.PoundForceSecondsPerSquareFoot
Pound force seconds per square foot.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.PoundForceFeetPerFoot
Pound force feet per foot.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.PoundForceFeet
Pound force feet.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Pi
Multiples of π.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Percentage
Percentage.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.PerMille
Per mille.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.PascalsPerMeter
Pascals per meter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Pascals
Pascals.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.PascalSeconds
Pascal seconds.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.OneToRatio
1 : Ratio.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.OhmMeters
Ohm meters.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.NewtonsPerSquareMillimeter
Newtons per square millimeter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.NewtonsPerSquareMeter
Newtons per square meter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.NewtonsPerMeter
Newtons per meter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Newtons
Newtons.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.NewtonSecondsPerSquareMeter
Newton seconds per square meter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.NewtonMetersPerMeter
Newton meters per meter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.NewtonMeters
Newton meters.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.NanogramsPerPascalSecondSquareMeter
Nanograms per pascal second square meter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Minutes
Minutes.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Millivolts
Millivolts.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Milliseconds
Milliseconds.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.MillimetersToTheSixthPower
Millimeters to the sixth power.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.MillimetersToTheFourthPower
Millimeters to the fourth power.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.MillimetersOfWaterColumnPerMeter
Millimeters of water column per meter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.MillimetersOfWaterColumn
Millimeters of water column.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.MillimetersOfMercury
Millimeters of mercury.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Millimeters
Millimeters.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Milliamperes
Milliamperes.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.MilesPerSecondSquared
Miles per second squared.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.MilesPerHour
Miles per hour.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.MicrometersPerMeterDegreeCelsius
Micrometers per meter degree Celsius.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.MicroinchesPerInchDegreeFahrenheit
Microinches per inch degree Fahrenheit.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.MetersToTheSixthPower
Meters to the sixth power.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.MetersToTheFourthPower
Meters to the fourth power.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.MetersPerSecondSquared
Meters per second squared.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.MetersPerSecond
Meters per second.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.MetersPerKilonewton
Meters per kilonewton.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.MetersOfWaterColumnPerMeter
Meters of water column per meter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.MetersOfWaterColumn
Meters of water column.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Meters
Meters.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Megapascals
Megapascals.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.MeganewtonsPerSquareMeter
Meganewtons per square meter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.MeganewtonsPerMeter
Meganewtons per meter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Meganewtons
Meganewtons.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.MeganewtonMetersPerMeter
Meganewton meters per meter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.MeganewtonMeters
Meganewton meters.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Lux
Lux.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.LumensPerWatt
Lumens per watt.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Lumens
Lumens.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.LitersPerSecondSquareMeter
Liters per second square meter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.LitersPerSecondKilowatt
Liters per second kilowatt.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.LitersPerSecondCubicMeter
Liters per second cubic meter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.LitersPerSecond
Liters per second.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.LitersPerMinute
Liters per minute.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.LitersPerHour
Liters per hour.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Liters
Liters.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.KipsPerSquareInch
Kips per square inch.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.KipsPerSquareFoot
Kips per square foot.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.KipsPerInch
Kips per inch.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.KipsPerFoot
Kips per foot.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.KipsPerCubicInch
Kips per cubic inch.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.KipsPerCubicFoot
Kips per cubic foot.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Kips
Kips.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.KipFeetPerFoot
Kip feet per foot.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.KipFeetPerDegreePerFoot
Kip feet per degree per foot.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.KipFeetPerDegree
Kip feet per degree.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.KipFeet
Kip feet.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Kilowatts
Kilowatts.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.KilowattHours
Kilowatt hours.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Kilovolts
Kilovolts.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.KilovoltAmperes
Kilovolt amperes.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Kilopascals
Kilopascals.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.KilonewtonsPerSquareMillimeter
Kilonewtons per square millimeter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.KilonewtonsPerSquareMeter
Kilonewtons per square meter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.KilonewtonsPerSquareCentimeter
Kilonewtons per square centimeter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.KilonewtonsPerMeter
Kilonewtons per meter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.KilonewtonsPerCubicMeter
Kilonewtons per cubic meter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Kilonewtons
Kilonewtons.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.KilonewtonMetersPerMeter
Kilonewton meters per meter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.KilonewtonMetersPerDegreePerMeter
Kilonewton meters per degree per meter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.KilonewtonMetersPerDegree
Kilonewton meters per degree.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.KilonewtonMeters
Kilonewton meters.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.KilometersPerSecondSquared
Kilometers per second squared.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.KilometersPerHour
Kilometers per hour.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.KilojoulesPerSquareMeterKelvin
Kilojoules per square meter Kelvin.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.KilojoulesPerKelvin
Kilojoules per Kelvin.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Kilojoules
Kilojoules.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.KilogramsPerSquareMeter
Kilograms per square meter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.KilogramsPerSecond
Kilograms per second.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.KilogramsPerMinute
Kilograms per minute.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.KilogramsPerMeterSecond
Kilograms per meter second.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.KilogramsPerMeterHour
Kilograms per meter hour.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.KilogramsPerMeter
Kilograms per meter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.KilogramsPerKilogramKelvin
Kilograms per kilogram kelvin.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.KilogramsPerHour
Kilograms per hour.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.KilogramsPerCubicMeter
Kilograms per cubic meter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.KilogramsForcePerSquareMeter
Kilograms force per square meter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.KilogramsForcePerMeter
Kilograms force per meter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.KilogramsForce
Kilograms force.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Kilograms
Kilograms.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.KilogramForceMetersPerMeter
Kilogram force meters per meter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.KilogramForceMeters
Kilogram force meters.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.KilocaloriesPerSecond
Kilocalories per second.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Kilocalories
Kilocalories.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Kiloamperes
Kiloamperes.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.KelvinInterval
Kelvin interval.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Kelvin
Kelvin.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.JoulesPerSquareMeterKelvin
Joules per square meter Kelvin.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.JoulesPerKilogramDegreeCelsius
Joules per kilogram degree Celsius.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.JoulesPerKelvin
Joules per Kelvin.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.JoulesPerGramDegreeCelsius
Joules per gram degree Celsius.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.JoulesPerGram
Joules per gram.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Joules
Joules.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.InverseKips
Inverse kips.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.InverseKilonewtons
Inverse kilonewtons.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.InverseDegreesFahrenheit
Inverse degrees Fahrenheit.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.InverseDegreesCelsius
Inverse degrees Celsius.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.InchesToTheSixthPower
Inches to the sixth power.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.InchesToTheFourthPower
Inches to the fourth power.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.InchesPerSecondSquared
Inches per second squared.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.InchesOfWater60DegreesFahrenheitPer100Feet
Inches of water (60 °F) per 100 feet.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.InchesOfWater60DegreesFahrenheit
Inches of water (60 °F).
Since:
2021

Autodesk.Revit.DB.UnitTypeId.InchesOfMercury32DegreesFahrenheit
Inches of mercury (32 °F).
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Inches
Inches.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Hours
Hours.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.HourSquareFootDegreesFahrenheitPerBritishThermalUnit
Hour square foot degrees Fahrenheit per British thermal unit.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Horsepower
Horsepower.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Hertz
Hertz.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Hectares
Hectares.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.GrainsPerHourSquareFootInchMercury
Grains per hour square foot inch mercury.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Gradians
Gradians.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.General
General.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Footlamberts
Footlamberts.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Footcandles
Footcandles.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Fixed
Fixed.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.FeetToTheSixthPower
Feet to the sixth power.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.FeetToTheFourthPower
Feet to the fourth power.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.FeetPerSecondSquared
Feet per second squared.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.FeetPerSecond
Feet per second.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.FeetPerMinute
Feet per minute.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.FeetPerKip
Feet per kip.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.FeetOfWater39_2DegreesFahrenheitPer100Feet
Feet of water (39.2 °F) per 100 feet.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.FeetOfWater39_2DegreesFahrenheit
Feet of water (39.2 °F).
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Feet
Feet.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.FahrenheitInterval
Fahrenheit interval.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Fahrenheit
Fahrenheit.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.DekanewtonsPerSquareMeter
Dekanewtons per square meter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.DekanewtonsPerMeter
Dekanewtons per meter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Dekanewtons
Dekanewtons.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.DekanewtonMetersPerMeter
Dekanewton meters per meter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.DekanewtonMeters
Dekanewton meters.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Degrees
Degrees.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Decimeters
Decimeters.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.CyclesPerSecond
Cycles per second.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.CurrencyPerWattHour
Cost per watt hour.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.CurrencyPerWatt
Cost per watt.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.CurrencyPerSquareMeter
Cost per square meter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.CurrencyPerSquareFoot
Cost per square foot.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.CurrencyPerBritishThermalUnitPerHour
Cost per British thermal unit per hour.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.CurrencyPerBritishThermalUnit
Cost per British thermal unit.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Currency
Currency.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.CubicYards
Cubic yards.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.CubicMillimeters
Cubic millimeters.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.CubicMetersPerWattSecond
Cubic meters per watt second.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.CubicMetersPerSecond
Cubic meters per second.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.CubicMetersPerKilonewton
Cubic meters per kilonewton.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.CubicMetersPerKilogram
Cubic meters per kilogram.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.CubicMetersPerHourSquareMeter
Cubic meters per hour square meter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.CubicMetersPerHourCubicMeter
Cubic meters per hour cubic meter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.CubicMetersPerHour
Cubic meters per hour.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.CubicMeters
Cubic meters.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.CubicInches
Cubic inches.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.CubicFeetPerPoundMass
Cubic feet per pound mass.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.CubicFeetPerMinuteTonOfRefrigeration
Cubic feet per minute ton of refrigeration.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.CubicFeetPerMinuteSquareFoot
Cubic feet per minute square foot.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.CubicFeetPerMinutePerBritishThermalUnitPerHour
Cubic feet per minute per British thermal unit per hour.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.CubicFeetPerMinuteCubicFoot
Cubic feet per minute cubic foot.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.CubicFeetPerMinute
Cubic feet per minute.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.CubicFeetPerKip
Cubic feet per kip.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.CubicFeetPerHour
Cubic feet per hour.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.CubicFeet
Cubic feet.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.CubicCentimeters
Cubic centimeters.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Centipoises
Centipoises.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.CentimetersToTheSixthPower
Centimeters to the sixth power.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.CentimetersToTheFourthPower
Centimeters to the fourth power.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.CentimetersPerMinute
Centimeters per minute.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Centimeters
Centimeters.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.CelsiusInterval
Celsius interval.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Celsius
Celsius.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.CandelasPerSquareMeter
Candelas per square meter.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.CandelasPerSquareFoot
Candelas per square foot.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Candelas
Candelas.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.CaloriesPerSecond
Calories per second.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Calories
Calories.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.BritishThermalUnitsPerSquareFootDegreeFahrenheit
British thermal units per square foot degree Fahrenheit.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.BritishThermalUnitsPerSecond
British thermal units per second.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.BritishThermalUnitsPerPoundDegreeFahrenheit
British thermal units per pound degree Fahrenheit.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.BritishThermalUnitsPerPound
British thermal units per pound.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.BritishThermalUnitsPerHourSquareFootDegreeFahrenheit
British thermal units per hour square foot degree Fahrenheit.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.BritishThermalUnitsPerHourSquareFoot
British thermal units per hour square foot.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.BritishThermalUnitsPerHourFootDegreeFahrenheit
British thermal units per hour foot degree Fahrenheit.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.BritishThermalUnitsPerHourCubicFoot
British thermal units per hour cubic foot.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.BritishThermalUnitsPerHour
British thermal units per hour.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.BritishThermalUnitsPerDegreeFahrenheit
British thermal units per degree Fahrenheit.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.BritishThermalUnits
British thermal units.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Bars
Bars.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Atmospheres
Atmospheres.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Amperes
Amperes.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Acres
Acres.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.StationingSurveyFeet
US survey feet.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.StationingMeters
Meters.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.StationingFeet
Feet.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.SlopeDegrees
Degrees.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.MetersCentimeters
Meters and centimeters.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.FractionalInches
Fractional inches.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.FeetFractionalInches
Feet and fractional inches.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.DegreesMinutes
Degrees minutes seconds.
Since:
2021

Autodesk.Revit.DB.UnitTypeId.Custom
Unrecognized custom unit.
Since:
2021

Autodesk.Revit.DB.UnitTypeId
This class contains constants identifying units of measurement.
Since:
2021